Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: ويستجيب الذين آمنوا وعملوا الصالحات ويزيدهم من فضله والكافرون لهم عذاب شديد
en: And accepteth those who do good works, and giveth increase unto them of His bounty. And as for disbelievers, theirs will be an awful doom.

source: ولو بسط الله الرزق لعباده لبغوا في الأرض ولكن ينزل بقدر ما يشاء إنه بعباده خبير بصير
en: And if Allah were to enlarge the provision for His slaves they would surely rebel in the earth, but He sendeth down by measure as He willeth. Lo! He is Informed, a Seer of His bondmen.

source: وهو الذي ينزل الغيث من بعد ما قنطوا وينشر رحمته وهو الولي الحميد
en: And He it is Who sendeth down the saving rain after they have despaired, and spreadeth out His mercy. He is the Protecting Friend, the Praiseworthy.

source: ومن آياته خلق السماوات والأرض وما بث فيهما من دابة وهو على جمعهم إذا يشاء قدير
en: And of His portents is the creation of the heaven and the earth, and of whatever beasts He hath dispersed therein. And He is Able to gather them when He will.

source: وما أصابكم من مصيبة فبما كسبت أيديكم ويعفو عن كثير
en: Whatever of misfortune striketh you, it is what your right hands have earned. And He forgiveth much.

source: وما أنتم بمعجزين في الأرض وما لكم من دون الله من ولي ولا نصير
en: Ye cannot escape in the earth, for beside Allah ye have no protecting friend nor any helper.

source: ومن آياته الجوار في البحر كالأعلام
en: And of His portents are the ships, like banners on the sea;

source: إن يشأ يسكن الريح فيظللن رواكد على ظهره إن في ذلك لآيات لكل صبار شكور
en: If He will He calmeth the wind so that they keep still upon its surface - Lo! herein verily are signs for every steadfast grateful (heart). -

source: أو يوبقهن بما كسبوا ويعف عن كثير
en: Or He causeth them to perish on account of that which they have earned - And He forgiveth much -

source: ويعلم الذين يجادلون في آياتنا ما لهم من محيص
en: And that those who argue concerning Our revelations may know they have no refuge.

source: فما أوتيتم من شيء فمتاع الحياة الدنيا وما عند الله خير وأبقى للذين آمنوا وعلى ربهم يتوكلون
en: Now whatever ye have been given is but a passing comfort for the life of the world, and that which Allah hath is better and more lasting for those who believe and put their trust in their Lord,

source: والذين يجتنبون كبائر الإثم والفواحش وإذا ما غضبوا هم يغفرون
en: And those who shun the worst of sins and indecencies and, when they are wroth, forgive,

source: والذين استجابوا لربهم وأقاموا الصلاة وأمرهم شورى بينهم ومما رزقناهم ينفقون
en: And those who answer the call of their Lord and establish worship, and whose affairs are a matter of counsel, and who spend of what We have bestowed on them,

source: والذين إذا أصابهم البغي هم ينتصرون
en: And those who, when great wrong is done to them, defend themselves,

source: وجزاء سيئة سيئة مثلها فمن عفا وأصلح فأجره على الله إنه لا يحب الظالمين
en: The guerdon of an ill-deed is an ill the like thereof. But whosoever pardoneth and amendeth, his wage is the affair of Allah. Lo! He loveth not wrong-doers.

source: ولمن انتصر بعد ظلمه فأولئك ما عليهم من سبيل
en: And whoso defendeth himself after he hath suffered wrong - for such, there is no way (of blame) against them.

source: إنما السبيل على الذين يظلمون الناس ويبغون في الأرض بغير الحق أولئك لهم عذاب أليم
en: The way (of blame) is only against those who oppress mankind, and wrongfully rebel in the earth. For such there is a painful doom.

source: ولمن صبر وغفر إن ذلك لمن عزم الأمور
en: And verily whoso is patient and forgiveth - lo! that, verily, is (of) the steadfast heart of things.

source: ومن يضلل الله فما له من ولي من بعده وترى الظالمين لما رأوا العذاب يقولون هل إلى مرد من سبيل
en: He whom Allah sendeth astray, for him there is no protecting friend after Him. And thou (Muhammad) wilt see the evil-doers when they see the doom, (how) they say: Is there any way of return?

source: وتراهم يعرضون عليها خاشعين من الذل ينظرون من طرف خفي وقال الذين آمنوا إن الخاسرين الذين خسروا أنفسهم وأهليهم يوم القيامة ألا إن الظالمين في عذاب مقيم
en: And thou wilt see them exposed to (the Fire), made humble by disgrace, and looking with veiled eyes. And those who believe will say: Lo! the (eternal) losers are they who lose themselves and their housefolk on the Day of Resurrection. Lo! are not the wrong-doers in perpetual torment?

source: وما كان لهم من أولياء ينصرونهم من دون الله ومن يضلل الله فما له من سبيل
en: And they will have no protecting friends to help them instead of Allah. He whom Allah sendeth astray, for him there is no road.

source: استجيبوا لربكم من قبل أن يأتي يوم لا مرد له من الله ما لكم من ملجإ يومئذ وما لكم من نكير
en: Answer the call of your Lord before there cometh unto you from Allah a Day which there is no averting. Ye have no refuge on that Day, nor have a ye any (power of) refusal.

source: فإن أعرضوا فما أرسلناك عليهم حفيظا إن عليك إلا البلاغ وإنا إذا أذقنا الإنسان منا رحمة فرح بها وإن تصبهم سيئة بما قدمت أيديهم فإن الإنسان كفور
en: But if they are averse, We have not sent thee as a warder over them. Thine is only to convey (the message). And lo! when We cause man to taste of mercy from Us he exulteth therefor. And if some evil striketh them because of that which their own hands have sent before, then lo! man is an ingrate.

source: لله ملك السماوات والأرض يخلق ما يشاء يهب لمن يشاء إناثا ويهب لمن يشاء الذكور
en: Unto Allah belongeth the Sovereignty of the heavens and the earth. He createth what He will. He bestoweth female (offspring) upon whom He will, and bestoweth male (offspring) upon whom He will;

source: أو يزوجهم ذكرانا وإناثا ويجعل من يشاء عقيما إنه عليم قدير
en: Or He mingleth them, males and females, and He maketh barren whom He will. Lo! He is Knower, Powerful.

source: وما كان لبشر أن يكلمه الله إلا وحيا أو من وراء حجاب أو يرسل رسولا فيوحي بإذنه ما يشاء إنه علي حكيم
en: And it was not (vouchsafed) to any mortal that Allah should speak to him unless (it be) by revelation or from behind a veil, or (that) He sendeth a messenger to reveal what He will by His leave. Lo! He is Exalted, Wise.

source: وكذلك أوحينا إليك روحا من أمرنا ما كنت تدري ما الكتاب ولا الإيمان ولكن جعلناه نورا نهدي به من نشاء من عبادنا وإنك لتهدي إلى صراط مستقيم
en: And thus have We inspired in thee (Muhammad) a Spirit of Our command. Thou knewest not what the Scripture was, nor what the Faith. But We have made it a light whereby We guide whom We will of Our bondmen. And lo! thou verily dost guide unto a right path,

source: صراط الله الذي له ما في السماوات وما في الأرض ألا إلى الله تصير الأمور
en: The path of Allah, unto Whom belongeth whatsoever is in the heavens and whatsoever is in the earth. Do not all things reach Allah at last?

source: والكتاب المبين
en: By the Scripture which maketh plain,

source: إنا جعلناه قرآنا عربيا لعلكم تعقلون
en: Lo! We have appointed it a Lecture, in Arabic that haply ye may understand.

source: وإنه في أم الكتاب لدينا لعلي حكيم
en: And Lo! in the Source of Decrees, which We possess, it is indeed sublime, decisive.

source: أفنضرب عنكم الذكر صفحا أن كنتم قوما مسرفين
en: Shall We utterly ignore you because ye are a wanton folk?

source: وكم أرسلنا من نبي في الأولين
en: How many a prophet did We send among the men of old!

source: وما يأتيهم من نبي إلا كانوا به يستهزئون
en: And never came there unto them a prophet but they used to mock him.

source: فأهلكنا أشد منهم بطشا ومضى مثل الأولين
en: Then We destroyed men mightier than these in prowess; and the example of the men of old hath gone (before them).

source: ولئن سألتهم من خلق السماوات والأرض ليقولن خلقهن العزيز العليم
en: And if thou (Muhammad) ask them: Who created the heavens and the earth, they will surely answer: The Mighty, the Knower created them;

source: الذي جعل لكم الأرض مهدا وجعل لكم فيها سبلا لعلكم تهتدون
en: Who made the earth a resting-place for you, and placed roads for you therein, that haply ye may find your way;

source: والذي نزل من السماء ماء بقدر فأنشرنا به بلدة ميتا كذلك تخرجون
en: And Who sendeth down water from the sky in (due) measure, and We revive a dead land therewith. Even so will ye be brought forth;

source: والذي خلق الأزواج كلها وجعل لكم من الفلك والأنعام ما تركبون
en: He Who created all the pairs, and appointed for you ships and cattle whereupon ye ride.

source: لتستووا على ظهوره ثم تذكروا نعمة ربكم إذا استويتم عليه وتقولوا سبحان الذي سخر لنا هذا وما كنا له مقرنين
en: That ye may mount upon their backs, and may remember your Lord's favour when ye mount thereon, and may say: Glorified be He Who hath subdued these unto us, and we were not capable (of subduing them);

source: وإنا إلى ربنا لمنقلبون
en: And lo! unto our Lord we surely are returning.

source: وجعلوا له من عباده جزءا إن الإنسان لكفور مبين
en: And they allot to Him a portion of His bondmen! Lo! man is verily a mere ingrate.

source: أم اتخذ مما يخلق بنات وأصفاكم بالبنين
en: Or chooseth He daughters of all that He hath created, and honoureth He you with sons?

source: وإذا بشر أحدهم بما ضرب للرحمن مثلا ظل وجهه مسودا وهو كظيم
en: And if one of them hath tidings of that which he likeneth to the Beneficent One, his countenance becometh black and he is full of inward rage.

source: أومن ينشأ في الحلية وهو في الخصام غير مبين
en: (Liken they then to Allah) that which is bred up in outward show, and in dispute cannot make itself plain?

source: وجعلوا الملائكة الذين هم عباد الرحمن إناثا أشهدوا خلقهم ستكتب شهادتهم ويسألون
en: And they make the angels, who are the slaves of the Beneficent, females. Did they witness their creation? Their testimony will be recorded and they will be questioned.

source: وقالوا لو شاء الرحمن ما عبدناهم ما لهم بذلك من علم إن هم إلا يخرصون
en: And they say: If the Beneficent One had (so) willed, we should not have worshipped them. They have no knowledge whatsoever of that. They do but guess.

source: أم آتيناهم كتابا من قبله فهم به مستمسكون
en: Or have We given them any scripture before (this Qur'an) so that they are holding fast thereto?

source: بل قالوا إنا وجدنا آباءنا على أمة وإنا على آثارهم مهتدون
en: Nay, for they say only: Lo! we found our fathers following a religion, and we are guided by their footprints.

source: وكذلك ما أرسلنا من قبلك في قرية من نذير إلا قال مترفوها إنا وجدنا آباءنا على أمة وإنا على آثارهم مقتدون
en: And even so We sent not a warner before thee (Muhammad) into any township but its luxurious ones said: Lo! we found our fathers following a religion, and we are following their footprints.

source: قال أولو جئتكم بأهدى مما وجدتم عليه آباءكم قالوا إنا بما أرسلتم به كافرون
en: (And the warner) said: What! Even though I bring you better guidance than that ye found your fathers following? They answered: Lo! in what ye bring we are disbelievers.

source: فانتقمنا منهم فانظر كيف كان عاقبة المكذبين
en: So We requited them. Then see the nature of the consequence for the rejecters!

source: وإذ قال إبراهيم لأبيه وقومه إنني براء مما تعبدون
en: And when Abraham said unto his father and his folk: Lo! I am innocent of what ye worship

source: إلا الذي فطرني فإنه سيهدين
en: Save Him Who did create me, for He will surely guide me.

source: وجعلها كلمة باقية في عقبه لعلهم يرجعون
en: And he made it a word enduring among his seed, that haply they might return.

source: بل متعت هؤلاء وآباءهم حتى جاءهم الحق ورسول مبين
en: Nay, but I let these and their fathers enjoy life (only) till there should come unto them the Truth and a messenger making plain.

source: ولما جاءهم الحق قالوا هذا سحر وإنا به كافرون
en: And now that the Truth hath come unto them they say: This is mere magic, and lo! we are disbelievers therein.

source: وقالوا لولا نزل هذا القرآن على رجل من القريتين عظيم
en: And they say: If only this Qur'an had been revealed to some great man of the two towns?

source: أهم يقسمون رحمت ربك نحن قسمنا بينهم معيشتهم في الحياة الدنيا ورفعنا بعضهم فوق بعض درجات ليتخذ بعضهم بعضا سخريا ورحمت ربك خير مما يجمعون
en: Is it they who apportion thy Lord's mercy? We have apportioned among them their livelihood in the life of the world, and raised some of them above others in rank that some of them may take labour from others; and the mercy of thy Lord is better than (the wealth) that they amass.

source: ولولا أن يكون الناس أمة واحدة لجعلنا لمن يكفر بالرحمن لبيوتهم سقفا من فضة ومعارج عليها يظهرون
en: And were it not that mankind would have become one community, We might well have appointed, for those who disbelieve in the Beneficent, roofs of silver for their houses and stairs (of silver) whereby to mount,

source: ولبيوتهم أبوابا وسررا عليها يتكئون
en: And for their houses doors (of silver) and couches of silver whereon to recline,

source: وزخرفا وإن كل ذلك لما متاع الحياة الدنيا والآخرة عند ربك للمتقين
en: And ornaments of gold. Yet all that would have been but a provision of the life of the world. And the Hereafter with your Lord would have been for those who keep from evil.

source: ومن يعش عن ذكر الرحمن نقيض له شيطانا فهو له قرين
en: And he whose sight is dim to the remembrance of the Beneficent, We assign unto him a devil who becometh his comrade;

source: وإنهم ليصدونهم عن السبيل ويحسبون أنهم مهتدون
en: And lo! they surely turn them from the way of Allah, and yet they deem that they are rightly guided;

source: حتى إذا جاءنا قال يا ليت بيني وبينك بعد المشرقين فبئس القرين
en: Till, when he cometh unto Us, he saith (unto his comrade): Ah, would that between me and thee there were the distance of the two horizons - an evil comrade!

source: ولن ينفعكم اليوم إذ ظلمتم أنكم في العذاب مشتركون
en: And it profiteth you not this day, because ye did wrong, that ye will be sharers in the doom.

source: أفأنت تسمع الصم أو تهدي العمي ومن كان في ضلال مبين
en: Canst thou (Muhammad) make the deaf to hear, or canst thou guide the blind or him who is in error manifest?

source: فإما نذهبن بك فإنا منهم منتقمون
en: And if We take thee away, We surely shall take vengeance on them,

source: أو نرينك الذي وعدناهم فإنا عليهم مقتدرون
en: Or (if) We show thee that wherewith We threaten them; for lo! We have complete command of them.

source: فاستمسك بالذي أوحي إليك إنك على صراط مستقيم
en: So hold thou fast to that which is inspired in thee. Lo! thou art on a right path.

source: وإنه لذكر لك ولقومك وسوف تسألون
en: And lo! it is in truth a Reminder for thee and for thy folk; and ye will be questioned.

source: واسأل من أرسلنا من قبلك من رسلنا أجعلنا من دون الرحمن آلهة يعبدون
en: And ask those of Our messengers whom We sent before thee: Did We ever appoint gods to be worshipped beside the Beneficent?

source: ولقد أرسلنا موسى بآياتنا إلى فرعون وملئه فقال إني رسول رب العالمين
en: And verily We sent Moses with Our revelations unto Pharaoh and his chiefs, and he said: I am a messenger of the Lord of the Worlds.

source: فلما جاءهم بآياتنا إذا هم منها يضحكون
en: But when he brought them Our tokens, behold! they laughed at them.

source: وما نريهم من آية إلا هي أكبر من أختها وأخذناهم بالعذاب لعلهم يرجعون
en: And every token that We showed them was greater than its sister (token), and We grasped them with the torment, that haply they might turn again.

source: وقالوا يا أيه الساحر ادع لنا ربك بما عهد عندك إننا لمهتدون
en: And they said: O wizard! Entreat thy Lord for us by the pact that He hath made with thee. Lo! we verily will walk aright.

source: فلما كشفنا عنهم العذاب إذا هم ينكثون
en: But when We eased them of the torment, behold! they broke their word.

source: ونادى فرعون في قومه قال يا قوم أليس لي ملك مصر وهذه الأنهار تجري من تحتي أفلا تبصرون
en: And Pharaoh caused a proclamation to be made among his people saying: O my people! Is not mine the sovereignty of Egypt and these rivers flowing under me? Can ye not then discern?

source: أم أنا خير من هذا الذي هو مهين ولا يكاد يبين
en: I am surely better than this fellow, who is despicable and can hardly make (his meaning) plain!

source: فلولا ألقي عليه أسورة من ذهب أو جاء معه الملائكة مقترنين
en: Why, then, have armlets of gold not been set upon him, or angels sent along with him?

source: فاستخف قومه فأطاعوه إنهم كانوا قوما فاسقين
en: Thus he persuaded his people to make light (of Moses), and they obeyed him. Lo! they were a wanton folk.

source: فلما آسفونا انتقمنا منهم فأغرقناهم أجمعين
en: So, when they angered Us, We punished them and drowned them every one.

source: فجعلناهم سلفا ومثلا للآخرين
en: And We made them a thing past, and an example for those after (them).

source: ولما ضرب ابن مريم مثلا إذا قومك منه يصدون
en: And when the son of Mary is quoted as an example, behold! the folk laugh out,

source: وقالوا أآلهتنا خير أم هو ما ضربوه لك إلا جدلا بل هم قوم خصمون
en: And say: Are our gods better, or is he? They raise not the objection save for argument. Nay! but they are a contentious folk.

source: إن هو إلا عبد أنعمنا عليه وجعلناه مثلا لبني إسرائيل
en: He is nothing but a slave on whom We bestowed favour, and We made him a pattern for the Children of Israel.

source: ولو نشاء لجعلنا منكم ملائكة في الأرض يخلفون
en: And had We willed We could have set among you angels to be viceroys in the earth.

source: وإنه لعلم للساعة فلا تمترن بها واتبعون هذا صراط مستقيم
en: And lo! verily there is knowledge of the Hour. So doubt ye not concerning it, but follow Me. This is the right path.

source: ولا يصدنكم الشيطان إنه لكم عدو مبين
en: And let not Satan turn you aside. Lo! he is an open enemy for you.

source: ولما جاء عيسى بالبينات قال قد جئتكم بالحكمة ولأبين لكم بعض الذي تختلفون فيه فاتقوا الله وأطيعون
en: When Jesus came with clear proofs (of Allah's Sovereignty), he said: I have come unto you with wisdom, and to make plain some of that concerning which ye differ. So keep your duty to Allah, and obey me.

source: إن الله هو ربي وربكم فاعبدوه هذا صراط مستقيم
en: Lo! Allah, He is my Lord and your Lord. So worship Him. This is a right path.

source: فاختلف الأحزاب من بينهم فويل للذين ظلموا من عذاب يوم أليم
en: But the factions among them differed. Then woe unto those who do wrong from the doom of a painful day.

source: هل ينظرون إلا الساعة أن تأتيهم بغتة وهم لا يشعرون
en: Await they aught save the Hour, that it shall come upon them suddenly, when they know not?

source: الأخلاء يومئذ بعضهم لبعض عدو إلا المتقين
en: Friends on that day will be foes one to another, save those who kept their duty (to Allah).

source: يا عباد لا خوف عليكم اليوم ولا أنتم تحزنون
en: O My slaves! For you there is no fear this day, nor is it ye who grieve;

source: الذين آمنوا بآياتنا وكانوا مسلمين
en: (Ye) who believed Our revelations and were self-surrendered,

source: ادخلوا الجنة أنتم وأزواجكم تحبرون
en: Enter the Garden, ye and your wives, to be made glad.

source: يطاف عليهم بصحاف من ذهب وأكواب وفيها ما تشتهيه الأنفس وتلذ الأعين وأنتم فيها خالدون
en: Therein are brought round for them trays of gold and goblets, and therein is all that souls desire and eyes find sweet. And ye are immortal therein.

source: وتلك الجنة التي أورثتموها بما كنتم تعملون
en: This is the Garden which ye are made to inherit because of what ye used to do.

source: لكم فيها فاكهة كثيرة منها تأكلون
en: Therein for you is fruit in plenty whence to eat.

source: إن المجرمين في عذاب جهنم خالدون
en: Lo! the guilty are immortal in hell's torment.

source: لا يفتر عنهم وهم فيه مبلسون
en: It is not relaxed for them, and they despair therein.

source: وما ظلمناهم ولكن كانوا هم الظالمين
en: We wronged them not, but they it was who did the wrong.

source: ونادوا يا مالك ليقض علينا ربك قال إنكم ماكثون
en: And they cry: O master! Let thy Lord make an end of us. He saith: Lo! here ye must remain.

source: لقد جئناكم بالحق ولكن أكثركم للحق كارهون
en: We verily brought the Truth unto you, but ye were, most of you, averse to the Truth.

source: أم أبرموا أمرا فإنا مبرمون
en: Or do they determine any thing (against the Prophet)? Lo! We (also) are determining.

source: أم يحسبون أنا لا نسمع سرهم ونجواهم بلى ورسلنا لديهم يكتبون
en: Or deem they that We cannot hear their secret thoughts and private confidences? Nay, but Our envoys, present with them, do record.

source: قل إن كان للرحمن ولد فأنا أول العابدين
en: Say (O Muhammad): If the Beneficent One hath a son, then, I shall be first among the worshippers. (But there is no son).

source: سبحان رب السماوات والأرض رب العرش عما يصفون
en: Glorified be the Lord of the heavens and the earth, the Lord of the Throne, from that which they ascribe (unto Him)!

source: فذرهم يخوضوا ويلعبوا حتى يلاقوا يومهم الذي يوعدون
en: So let them flounder (in their talk) and play until they meet the Day which they are promised.

source: وهو الذي في السماء إله وفي الأرض إله وهو الحكيم العليم
en: And He it is Who in the heaven is Allah, and in the earth Allah. He is the Wise, the Knower.

source: وتبارك الذي له ملك السماوات والأرض وما بينهما وعنده علم الساعة وإليه ترجعون
en: And blessed be He unto Whom belongeth the Sovereignty of the heavens and the earth and all that is between them, and with Whom is knowledge of the Hour, and unto Whom ye will be returned.

source: ولا يملك الذين يدعون من دونه الشفاعة إلا من شهد بالحق وهم يعلمون
en: And those unto whom they cry instead of Him possess no power of intercession, saving him who beareth witness unto the Truth knowingly.

source: ولئن سألتهم من خلقهم ليقولن الله فأنى يؤفكون
en: And if thou ask them who created them, they will surely say: Allah. How then are they turned away?

source: وقيله يا رب إن هؤلاء قوم لا يؤمنون
en: And he saith: O my Lord! Lo! these are a folk who believe not.

source: فاصفح عنهم وقل سلام فسوف يعلمون
en: Then bear with them (O Muhammad) and say: Peace. But they will come to know.

source: إنا أنزلناه في ليلة مباركة إنا كنا منذرين
en: Lo! We revealed it on a blessed night - Lo! We are ever warning -

source: فيها يفرق كل أمر حكيم
en: Whereon every wise command is made clear

source: أمرا من عندنا إنا كنا مرسلين
en: As a command from Our presence - Lo! We are ever sending -

source: رحمة من ربك إنه هو السميع العليم
en: A mercy from thy Lord. Lo! He, even He is the Hearer, the Knower,

source: رب السماوات والأرض وما بينهما إن كنتم موقنين
en: Lord of the heavens and the earth and all that is between them, if ye would be sure.

source: لا إله إلا هو يحيي ويميت ربكم ورب آبائكم الأولين
en: There is no Allah save Him. He quickeneth and giveth death; your Lord and Lord of your forefathers.

source: بل هم في شك يلعبون
en: Nay, but they play in doubt.

source: فارتقب يوم تأتي السماء بدخان مبين
en: But watch thou (O Muhammad) for the day when the sky will produce visible smoke

source: يغشى الناس هذا عذاب أليم
en: That will envelop the people. This will be a painful torment.

source: ربنا اكشف عنا العذاب إنا مؤمنون
en: (Then they will say): Our Lord relieve us of the torment. Lo! we are believers.

source: أنى لهم الذكرى وقد جاءهم رسول مبين
en: How can there be remembrance for them, when a messenger making plain (the Truth) had already come unto them,

source: ثم تولوا عنه وقالوا معلم مجنون
en: And they had turned away from him and said: One taught (by others), a madman?

source: إنا كاشفو العذاب قليلا إنكم عائدون
en: Lo! We withdraw the torment a little. Lo! ye return (to disbelief).

source: يوم نبطش البطشة الكبرى إنا منتقمون
en: On the day when We shall seize them with the greater seizure, (then) in truth We shall punish.

source: ولقد فتنا قبلهم قوم فرعون وجاءهم رسول كريم
en: And verily We tried before them Pharaoh's folk, when there came unto them a noble messenger,

source: أن أدوا إلي عباد الله إني لكم رسول أمين
en: Saying: Give up to me the slaves of Allah. Lo! I am a faithful messenger unto you.

source: وأن لا تعلوا على الله إني آتيكم بسلطان مبين
en: And saying: Be not proud against Allah. Lo! I bring you a clear warrant.

source: وإني عذت بربي وربكم أن ترجمون
en: And lo! I have sought refuge in my Lord and your Lord lest ye stone me to death.

source: وإن لم تؤمنوا لي فاعتزلون
en: And if ye put no faith in me, then let me go.

source: فدعا ربه أن هؤلاء قوم مجرمون
en: And he cried unto his Lord, (saying): These are guilty folk.
